day11/02codeStreamFieldInitialization/codeStream_INIT/fillBox_BCIC/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    leftWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2500;
        startFace       367500;
    }
    rightWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2500;
        startFace       370000;
    }
    frontWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2500;
        startFace       372500;
    }
    backWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2500;
        startFace       375000;
    }
    bottomWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2500;
        startFace       377500;
    }
    top
    {
        type            patch;
        nFaces          2500;
        startFace       380000;
    }
)

// ************************************************************************* //
