day11/02codeStreamFieldInitialization/codeStream_INIT/fillBox_BCIC/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;
maxAlphaCo      1;

maxDeltaT       1;

// ************************************************************************* //

functions
{

///////////////////////////////////////////////////////////////////////////

minmaxdomain
{
    type fieldMinMax;

    functionObjectLibs ("libfieldFunctionObjects.so");

    enabled true; //true or false

    mode component;

    writeControl timeStep;
    writeInterval 1;

    log true;

    fields (p p_rgh U alpha.water);
}

///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////
water_in_domain
{
    type            volFieldValue;
    functionObjectLibs ("libfieldFunctionObjects.so");
    enabled         true;

    writeFields off;

    //writeControl     outputTime;
    writeControl   timeStep;
    writeInterval  1;

    log             true;

    valueOutput     false;

    regionType      all;

    operation       volIntegrate;
    fields
    (
        alpha.water
    );
}

///////////////////////////////////////////////////////////////////////////

};